import { Product } from "@/types";

export const HEADER_ITEMS = ["Home", "ToDoList", "Products", "Users"] as const;

export const products: Product[] = [
  {
    id: "1",
    name: "گوشی هوشمند",
    price: 12000000,
    description: "گوشی قدرتمند با پردازنده سریع و دوربین با کیفیت."
  },
  {
    id: "2",
    name: "لپ‌تاپ",
    price: 35000000,
    description: "لپ‌تاپ مناسب کارهای گرافیکی و برنامه‌نویسی."
  },
  {
    id: "3",
    name: "هدفون بی‌سیم",
    price: 1800000,
    description: "کیفیت صدای بالا و باتری طولانی‌مدت."
  },
  {
    id: "4",
    name: "تلویزیون ۴K",
    price: 22000000,
    description: "تلویزیون با کیفیت تصویر فوق‌العاده و صفحه‌نمایش بزرگ."
  },
  {
    id: "5",
    name: "تبلت",
    price: 9500000,
    description: "تبلت سبک و مناسب برای مطالعه و تماشای ویدیو."
  },
  {
    id: "6",
    name: "ساعت هوشمند",
    price: 4300000,
    description: "ساعت هوشمند با قابلیت پایش سلامت و نوتیفیکیشن‌ها."
  },
  {
    id: "7",
    name: "دوربین دیجیتال",
    price: 17000000,
    description: "دوربین با کیفیت عکاسی حرفه‌ای و سنسور پیشرفته."
  },
  {
    id: "8",
    name: "کنسول بازی",
    price: 21000000,
    description: "کنسول نسل جدید برای بازی‌های با گرافیک بالا."
  },
  {
    id: "9",
    name: "ماوس بی‌سیم",
    price: 750000,
    description: "ماوس سبک، بی‌سیم و مناسب برای کارهای روزمره."
  },
  {
    id: "10",
    name: "کیبورد مکانیکی",
    price: 1900000,
    description: "کیبورد مقاوم با نور پس‌زمینه و سوییچ‌های دقیق."
  }
];
